/*
 * mph.h
 *
 * –ú–æ–¥—É–ª—å –ø–æ—Å—Ç–æ—è–Ω–Ω—ã—Ö —Ö–∞—Ä–∞–∫—Ç–µ—Ä–∏—Å—Ç–∏–∫
 * *******************************
 *
 *  Created on: 13.10.2011
 *      Author: nazemnyh
 */

#ifndef MPH_H_
#define MPH_H_

#include <cpp/universal.h>
#include <cpp/eeprom.h>
#include <cpp/scheduler.h>
#include "CanDat.h"
#include "CanDesriptors.h"

// ------------------------------------------- –Ø—á–µ–π–∫–∞ -------------------------------------------‚ñ∫
//
// ~~~ –ü—Ä–æ–±–ª–µ–º–∞: ~~~
// –•–æ—Ç–µ–ª–æ—Å—å –±—ã –∏–º–µ—Ç—å —è—á–µ–π–∫—É –ø–∞–º—è—Ç–∏ –≤ eeprom, –∫–æ—Ç–æ—Ä–∞—è –±—ã –ø–æ–º–∏–º–æ —Ö—Ä–∞–Ω–µ–Ω–∏—è –∑–Ω–∞—á–µ–Ω–∏—è –µ—â—ë –±—ã:
// 1. –•—Ä–∞–Ω–∏–ª–∞ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é –æ —Ç–æ–º, –±—ã–ª–∞ –ª–∏ –æ–Ω–∞ –∑–∞–ø–∏—Å–∞–Ω–∞ (—Ç–æ –µ—Å—Ç—å —Å–æ–¥–µ—Ä–∂–∏—Ç —Ä–µ–∞–ª—å–Ω—ã–µ –¥–∞–Ω–Ω—ã–µ)
// 2. –ö–æ–Ω—Ç—Ä–æ–ª–∏—Ä–æ–≤–∞–ª–∞ —Ü–µ–ª–æ—Å—Ç–Ω–æ—Å—Ç—å —Ö—Ä–∞–Ω–∏–º—ã—Ö –¥–∞–Ω–Ω—ã—Ö.
// 3. –í–∑—è–ª–∞ –±—ã –Ω–∞ —Å–µ–±—è —Ñ—É–Ω–∫—Ü–∏–∏ –ø–æ –æ–∂–∏–¥–∞–Ω–∏—é –≥–æ—Ç–æ–≤–Ω–æ—Å—Ç–∏ eeprom –∏ –ø—Ä–æ—á–µ–µ.
//
//  ~~~ –ó–∞–¥–∞—á–∞: ~~~
// 1. –°–æ–∑–¥–∞—Ç—å –∫–ª–∞—Å—Å, –æ–±—ä–µ–∫—Ç –∫–æ—Ç–æ—Ä–æ–≥–æ –¥–æ–ª–∂–µ–Ω —Å–æ–¥–µ—Ä–∂–∞—Ç—å –¥–æ–ø. –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é (—Ñ–ª–∞–≥ –∑–∞–ø–∏—Å–∏ –∏ –∫–æ–Ω—Ç—Ä–æ–ª—å–Ω—É—é —Å—É–º–º—É)
// 2. –ï–≥–æ —Ñ—É–Ω–∫—Ü–∏–∏ —á—Ç–µ–Ω–∏—è/–∑–∞–ø–∏—Å–∏ –±–µ—Ä—É—Ç –Ω–∞ —Å–µ–±—è –∫–æ–Ω—Ç—Ä–æ–ª—å –∫–æ–Ω—Ç—Ä–ª—å–Ω–æ–π —Å—É–º–º—ã –∏ –≤—ã—Å—Ç–∞–≤–ª–µ–Ω–∏–µ —Ñ–ª–∞–≥–∞ –∑–∞–ø–∏—Å–∏.

// 6. –û–ø–µ—Ä–∞—Ü–∏—è –æ–ø—Ä–µ–¥–µ–ª–µ–Ω–∏—è –∑–∞–ø–∏—Å–∞–Ω–Ω–æ—Å—Ç–∏ –Ω–µ–±–ª–æ–∫–∏—Ä—É—é—â–∞—è, –∑–∞–ø—É—Å–∫–∞—Ç–µ—Å—è –≤—Å–µ–≥–¥–∞,
//    –ø–æ –∑–∞–≤–µ—Ä—à–µ–Ω–∏—é –≤—ã–∑—ã–≤–∞–µ—Ç –¥–µ–ª–µ–≥–∞—Ç, –∫–æ—Ç–æ—Ä–æ–º—É –ø–µ—Ä–µ–¥–∞—ë—Ç —Ä–µ–∑—É–ª—å—Ç–∞—Ç —Ä–∞–±–æ—Ç—ã.
// 7. –û–ø–µ—Ä–∞—Ü–∏—è –ø—Ä–æ–≤–µ—Ä–∫–∏ —Ü–µ–ª–æ—Å—Ç–Ω–æ—Å—Ç–∏ –Ω–µ–±–ª–æ–∫–∏—Ä—É—é—â–∞—è, –∑–∞–ø—É—Å–∫–∞–µ—Ç—Å—è –≤—Å–µ–≥–¥–∞,
//    –ø–æ –∑–∞–≤–µ—Ä—à–µ–Ω–∏—é –≤—ã–∑—ã–≤–∞–µ—Ç –¥–µ–ª–µ–≥–∞—Ç, –∫–æ—Ç–æ—Ä–æ–º—É –ø–µ—Ä–µ–¥–∞—ë—Ç —Ä–µ–∑—É–ª—å—Ç–∞—Ç —Ä–∞–±–æ—Ç—ã.
// 8. –û–ø–µ—Ä–∞—Ü–∏—è –ø—Ä–µ—Ä—ã–≤–∞–Ω–∏—è –≤—Å–µ—Ö —Ç–µ–∫—É—â–∏—Ö –Ω–µ–±–ª–æ–∫–∏—Ä—É—é—â–∏—Ö –æ–ø–µ—Ä–∞—Ü–∏–π.
//    –ü—Ä–µ—Ä—ã–≤–∞–µ—Ç –≤—Å–µ –æ–ø–µ—Ä–∞—Ü–∏–∏ —Ç–∞–∫ –±—ã—Å—Ç—Ä–æ, –∫–∞–∫ —ç—Ç–æ –≤–æ–∑–º–æ–∂–Ω–æ. –ü–æ—Å–ª–µ —ç—Ç–æ–≥–æ –≤—ã–∑—ã–≤–∞–µ—Ç –¥–µ–ª–µ–≥–∞—Ç.
//
/* ~~~ –ü—Ä–∏–º–µ—Ä: ~~~
	EeCell cell;


	void periodicalFunction (uint16_t)
	{
		static uint32_t data = 0;
		cell.read (data);	// data –±—É–¥–µ—Ç –ø—Ä–æ—á–∏—Ç–∞–Ω–æ, –µ—Å–ª–∏ –ø–æ–ª—É—á–∏—Ç—Å—è
							// –≤ –ø—Ä–æ—Ç–∏–≤–Ω–æ–º —Å–ª—É—á–∞–µ, –∑–Ω–∞—á–µ–Ω–∏–µ data –ø—Ä–æ—Å—Ç–æ —Å–æ—Ö—Ä–∞–Ω–∏—Ç—å—Å—è

		// ... —Ä–∞–±–æ—Ç–∞ —Å data ...
	}

	void getWrittenResult (uint16_t);
	void getGoodnessResult (uint16_t);
	void exactlyGetData (uint16_t)
	{
		static uint32_t data = 0;
		if ( cell.read (data) ) // –µ—Å–ª–∏ –ø–æ–ª—É—á–∏–ª–æ—Å—å
		{
			// OK
		}
		else
		{
			cell.isWritten( SoftIntHandler::from_function<&getWrittenResult>() );
		}
	}

	void getWrittenResult (uint16_t result)
	{
		if (result) // –∑–∞–ø–∏—Å–∞–Ω?
		{
			// —è—á–µ–π–∫–∞ –∑–∞–ø–∏—Å–∞–Ω–∞. –∏–º–µ–µ—Ç —Å–º—ã—Å–ª –ø—Ä–æ–≤–µ—Ä–∏—Ç—å —Ü–µ–ª–æ—Å—Ç–Ω–æ—Å—Ç—å
			 cell.isGood( SoftIntHandler::from_function<&getGoodnessResult>() );
		}
		else
		{
			// –∫ —Å–æ–∂–∞–ª–µ–Ω–∏—é, —è—á–µ–π–∫–∞ –Ω–µ –∑–∞–ø–∏—Å–∞–Ω–∞...
		}

	}

	void getGoodnessnResult (uint16_t result)
	{
		if (result) // –±–µ–∑ –æ—à–∏–±–æ–∫?
		{
			// —è—á–µ–π–∫–∞ –∫–æ—Ä—Ä–µ–∫—Ç–Ω–æ –∑–∞–ø–∏—Å–∞–Ω–∞.
			// —á—Ç–µ–Ω–∏–µ –Ω–µ —É–¥–∞–ª–æ—Å—å –∏–∑-–∑–∞ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏. –ø–æ–≤—Ç–æ—Ä–∏–º –µ—â—ë —Ä–∞–∑.
			dispatcher.add ( SoftIntHandler::from_function<&exactlyGetData>(), 0 );
		}
		else
		{
			// –∫ —Å–æ–∂–∞–ª–µ–Ω–∏—é, –ø–∞–º—è—Ç—å –∏—Å–ø–æ—Ä—á–µ–Ω–∞, –¥–∞–Ω–Ω—ã–µ –ø–æ–≤—Ä–µ–∂–¥–µ–Ω—ã...
		}
	}

	void afterWrite (uint16_t result);
	void writeValue (uint16_t value)
	{
		if ( cell.write (value) ) // –ø—ã—Ç–∞–µ–º—Å—è –∑–∞–ø–∏—Å–∞—Ç—å
		{
			// –ø—Ä–æ—Ü–µ—Å—Å –Ω–∞—á–∞–ª–∞—Å—è. –ó–∞–ø–∏—Å—å –∏–¥—ë—Ç –≤ —Ñ–æ–Ω–µ, –ø–æ—Å–ª–µ –Ω–µ—ë –±—É–¥–µ—Ç –≤—ã–∑—ã–≤–∞–Ω –¥–µ–ª–µ–≥–∞—Ç.
		}
		else
		{
			// –ø–∞–º—è—Ç—å –∑–∞–Ω—è—Ç–∞. —á—Ç–æ –∂–µ, –ø–æ–ø—Ä–æ–±—É–µ–º –µ—â—ë —Ä–∞–∑.
			dispatcher.add( SoftIntHandler::from_fucntion<&writeValue>(), value );
		}
	}

	void afterWrite (uint16_t result)
	{
		if (result) // –∑–∞–ø–∏—Å–∞–Ω–∞ –∫–æ—Ä—Ä–µ–∫—Ç–Ω–æ
		{
			// –ø—Ä–∏–º–∏—Ç–µ –º–æ–∏ –ø–æ–∑–¥—Ä–∞–≤–ª–µ–Ω–∏—è!
		}
		else
		{
			// –ø—Ä–∏–º–∏—Ç–µ –º–æ–∏ —Å–æ–±–æ–ª–µ–∑–Ω–æ–≤–∞–Ω–∏—è...
		}
	}

	int main ()
	{
		for (;;)
			dispatcher.invoke ();
	}
 *
 */

namespace EeCellStaticPrivate
{
	struct StatusField
	{
		struct
		{
			uint8_t	unWritten	:1; // 0 - –∑–∞–ø–∏—Å–∞–Ω–æ, –ø–æ—Ç–æ–º—É —á—Ç–æ –∏–∑–Ω–∞—á–∞–ª—å–Ω–æ –ø–æ—Å–ª–µ —Å—Ç–∏—Ä–∞–Ω–∏—è –≤ eeprom –≤—Å–µ –±–∏—Ç—ã = 1
			uint8_t	crc7		:7;
		};
	};
	typedef Bitfield<StatusField> Status;

	bool activeWrite = false;
	Complex<uint32_t> data;
	Status status;
	SoftIntHandler afterWrite;
	SoftIntHandler isGoodResultGetter;
	SoftIntHandler isWrittenResultGetter;

	bool eepromOpRunning;
	enum ResetRequest
	{
		No	= 0,
		SelfWaitCycle = 1,
		AfterEepromOp = 2
	};
	ResetRequest resetRequest (No);
	SoftIntHandler afterReset;
}

class EeCell
{
public:
	bool write( const uint32_t& value, const SoftIntHandler& runAfterWriteEnd = SoftIntHandler() );
	bool read ( uint32_t& value );
	void isGood ( const SoftIntHandler& resultGetter );
	void isWritten ( const SoftIntHandler& resultGetter );
	void reset ( const SoftIntHandler& runAfterReset = SoftIntHandler() );

private:
	uint8_t crc7x2 (uint8_t crcx2, uint8_t data);

	void writeStatus (uint16_t);
	void writeData (uint16_t);
	void calcCrc (uint16_t);
	void writeCrc (uint16_t);
	void lastControl (uint16_t);
	void goodDelayedRequest (uint16_t);
	void writtenDelayedRequest (uint16_t);
	void runAfterReset (uint16_t);

	Eeprom< EeCellStaticPrivate::Status > status;
	Eeprom<uint32_t> data;
};


bool EeCell::write (const uint32_t& value, const SoftIntHandler& runAfterWrite)
{
	namespace Static = EeCellStaticPrivate;
	if ( !Static::activeWrite )
	{
		Static::activeWrite = true;

		Static::data = value;
		Static::afterWrite = runAfterWrite;

		Static::status = status;
		Static::status.unWritten = 1; 	// –í —Å–ª—É—á–∞–µ –ø—Ä–µ—Ä—ã–≤–∞–Ω–∏—è –∑–∞–ø–∏—Å–∏, —á—Ç–æ–±—ã —è—á–µ–π–∫–∞ –Ω–µ –æ–∫–∞–∑–∞–ª–∞—Å—å –ª–æ–∂–Ω–æ –∏—Å–ø–æ—Ä—á–µ–Ω–Ω–æ–π
		writeStatus (0);

		return true;
	}
	else
		return false;
}

bool EeCell::read(uint32_t& value)
{
	if ( !EeCellStaticPrivate::activeWrite  && status.isReady() && data.isReady() )
	{
		EeCellStaticPrivate::Status s = status;

		if (!s.unWritten)
		{
			Complex<uint32_t> d = (uint32_t) data;

			uint8_t crc = 0xFF;
			for (uint8_t i = 0; i < 4; i++)
				crc = crc7x2 (crc, d[i]);

			if (crc/2 == s.crc7)
			{
				value = d;
				return true;
			}
			else
				return false;
		}
		else
			return false;
	}
	else
		return false;
}

void EeCell::isGood( const SoftIntHandler& resultGetter )
{
	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		if ( !EeCellStaticPrivate::activeWrite )
		{
			uint8_t sreg = reg.status;
			cli();
			if ( status.isReady() )
			{
				EeCellStaticPrivate::Status s = status;
				reg.status = sreg;

				if (!s.unWritten)
				{
					uint8_t sreg = reg.status;
					cli();
					if ( data.isReady() )
					{
						Complex<uint32_t> d = (uint32_t) data;
						reg.status = sreg;

						uint8_t crc = 0xFF;
						for (uint8_t i = 0; i < 4; i++)
							crc = crc7x2 (crc, d[i]);

						dispatcher.add( resultGetter, crc/2 == s.crc7 );
						return;
					}
					else
						reg.status = sreg;
				}
				else
				{
					dispatcher.add( resultGetter, true );
					return;
				}
			}
			else
				reg.status = sreg;
		}
		// –ï—Å–ª–∏ –Ω–µ —É—à–ª–∏ –ø–æ return –≤—ã—à–µ
		EeCellStaticPrivate::isGoodResultGetter = resultGetter;
		dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::goodDelayedRequest> (this), 0 );
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}
}

void EeCell::isWritten( const SoftIntHandler& resultGetter )
{
	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		if ( !EeCellStaticPrivate::activeWrite )
		{
			uint8_t sreg = reg.status;
			cli();
			if ( status.isReady() )
			{
				EeCellStaticPrivate::Status s = status;
				reg.status = sreg;

				if (!s.unWritten)
					dispatcher.add( resultGetter, true );
				else
					dispatcher.add( resultGetter, false );

				return;
			}
			else
				reg.status = sreg;
		}
		// –ï—Å–ª–∏ –Ω–µ —É—à–ª–∏ –ø–æ return –≤—ã—à–µ
		EeCellStaticPrivate::isWrittenResultGetter = resultGetter;
		dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::writtenDelayedRequest> (this), 0 );
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}
}

void EeCell::reset( const SoftIntHandler& runAfterReset )
{
	using namespace EeCellStaticPrivate;
	afterReset = runAfterReset;

	if (eepromOpRunning)
		resetRequest = ResetRequest::AfterEepromOp;
	else
	{
		resetRequest = ResetRequest::SelfWaitCycle;
		// –ü–æ—Å–ª–µ –≤—Å–µ—Ö –∑–∞–¥–∞—á –≤ –æ—á–µ—Ä–µ–¥–∏ –∑–∞–ø—É—Å—Ç–∏—Ç—å:
		dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::runAfterReset> (this), 0 );
	}
}

uint8_t EeCell::crc7x2 (uint8_t crcx2, uint8_t data)
{
	crcx2 ^= data;
    for (uint8_t i = 0; i < 8; i++)
        crcx2 = crcx2 & 0x80 ? (crcx2 << 1) ^ (0x37 * 2) : crcx2 << 1;
	return crcx2;
}


void EeCell::writeStatus (uint16_t )
{
	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		if ( status.updateUnblock( EeCellStaticPrivate::status, SoftIntHandler::from_method<EeCell, &EeCell::writeData>(this) ) )
			EeCellStaticPrivate::eepromOpRunning = true;
		else
				dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::writeStatus> (this), 0 );
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}
}

void EeCell::writeData (uint16_t )
{
	EeCellStaticPrivate::eepromOpRunning = false;

	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		if ( data.updateUnblock( EeCellStaticPrivate::data, SoftIntHandler::from_method<EeCell, &EeCell::calcCrc>(this) ) )
			EeCellStaticPrivate::eepromOpRunning = true;
		else
			dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::writeData> (this), 0 );
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}
}

void EeCell::calcCrc (uint16_t )
{
	EeCellStaticPrivate::eepromOpRunning = false;

	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		namespace Static = EeCellStaticPrivate;
		uint8_t crc = 0xFF;
		for (uint8_t i = 0; i < 4; i++)
			crc = crc7x2 (crc, Static::data[i]);

		Static::status.crc7 = crc/2;
		Static::status.unWritten = 0;

		writeCrc (0);
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}
}

void EeCell::writeCrc (uint16_t )
{
	EeCellStaticPrivate::eepromOpRunning = false;

	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		if ( status.updateUnblock( EeCellStaticPrivate::status,  SoftIntHandler::from_method<EeCell, &EeCell::lastControl>(this) ) )
			EeCellStaticPrivate::eepromOpRunning = true;
		else
			dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::writeCrc> (this), 0 );
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}
}

void EeCell::lastControl (uint16_t )
{
	namespace Static = EeCellStaticPrivate;

	Static::eepromOpRunning = false;

	if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::No)
	{
		uint8_t sreg = reg.status;
		cli ();
		if ( status.isReady() && data.isReady() )
		{
			Static::Status s = status;
			uint32_t d = data;
			reg.status = sreg;

			dispatcher.add( EeCellStaticPrivate::afterWrite,
							(Static::status == s) && (Static::data == d) );

			Static::activeWrite = false;
		}
		else
		{
			reg.status = sreg;
			dispatcher.add( SoftIntHandler::from_method<EeCell, &EeCell::lastControl>(this), 0 );
		}
	}
	else if (EeCellStaticPrivate::resetRequest == EeCellStaticPrivate::ResetRequest::SelfWaitCycle)
	{
		runAfterReset (0);
	}

}

void EeCell::goodDelayedRequest (uint16_t )
{
	isGood ( EeCellStaticPrivate::isGoodResultGetter );
}

void EeCell::writtenDelayedRequest (uint16_t )
{
	isWritten ( EeCellStaticPrivate::isWrittenResultGetter );
}

void EeCell::runAfterReset (uint16_t)
{
	EeCellStaticPrivate::resetRequest = EeCellStaticPrivate::ResetRequest::No;
	dispatcher.add( EeCellStaticPrivate::afterReset, 0 );
	EeCellStaticPrivate::activeWrite = false;
}


// --------------------------------------- –°—Ç—Ä—É–∫—Ç—É—Ä–∞ –¥–∞–Ω–Ω—ã—Ö -------------------------------------‚ñ∫

struct EepromData
{
	EepromData () {}

	enum DpsPosition { Left = 0, Right = 1 };
	enum VelocityGauge { CL = 0, KPD = 1 }; 	// –?–∑–º–µ—Ä–∏—Ç–µ–ª—å —Å–∫–æ—Ä–æ—Å—Ç–∏
	enum IfSignal { ALS = 0, CKR = 1 };
	enum AlarmSystem { ALSN = 0, CLUB = 1 };

	union Saut
	{
		Saut () {}

		struct
		{
			Eeprom<uint8_t> data [14];
			Eeprom<uint16_t> crc; // CRC16 –Ω–∞ –±–∞–∑–∏—Å–µ 0xEBA9
		} string [2];

		struct Property
		{
			Eeprom<uint16_t>	string1Number;   			// + –Ω–æ–º–µ—Ä –ø–µ—Ä–≤–æ–π —Å—Ç—Ä–æ–∫–∏ (0x0600)BigEndian
			Eeprom<uint8_t>		diameterAverageDiv10; 		// + –§–∞–∫—Ç–∏—á–µ—Å–∫–∏–π –¥–∏–∞–º–µ—Ç—Ä –±–∞–Ω–¥–∞–∂–∞ –≤ –º–º (–º–∞–∫—Å–∏–º–∞–ª—å–Ω—ã–π –∏–∑ –¥–≤—É—Ö: –î–ü–°1 –∏–ª–∏ –î–ü–°2, –¥–µ–ª–µ–Ω–Ω—ã–π –Ω–∞ 10, –ø–ª—é—Å 1).
			struct SpeedLimitation
			{
				uint8_t redYellowDiv10Minus1	:4;
				uint8_t maxDiv10Minus1			:4;
			};
			Eeprom< Bitfield<SpeedLimitation> >		vPassenger;			// +! Vmax –ø–∞—Å—Å. + V–∫–∂ –ø–∞—Å—Å
			Eeprom< Bitfield<SpeedLimitation> >		vCargo;				// +! Vmax –≥—Ä—É–∑. + V–∫–∂ –≥—Ä—É–∑
			Eeprom< Bitfield<SpeedLimitation> >		vElecticTrain;		// +! Vmax —ç–ª.–ø–æ–µ–∑–¥. + V–∫–∂ —ç–ª.–ø–æ–µ–∑–¥
			Eeprom<uint8_t>		blockMinLength;				// –ú–∏–Ω–∏–º–∞–ª—å–Ω–∞—è –¥–ª–∏–Ω–∞ –±–ª–æ–∫-—É—á–∞—Å—Ç–∫–∞ (–¥–µ–ª–µ–Ω–Ω–∞—è –Ω–∞ 10).–í –ë–≠–ö2 –Ω–µ –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è, –≤ –ë–≠–ö –Ω–µ –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –Ω–∞—á–∏–Ω–∞—è —Å –≤–µ—Ä—Å–∏–∏ 33
			Eeprom<uint8_t>		locoType;					// +! –¢–∏–ø –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞.
			Eeprom<uint8_t>		diameterAvarageForLocoType;	// –°—Ä–µ–¥–Ω–∏–π –¥–∏–∞–º–µ—Ç—Ä –±–∞–Ω–¥–∞–∂–∞ –¥–∞–Ω–Ω–æ–≥–æ —Ç–∏–ø–∞ –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞ (–¥–µ–ª–µ–Ω–Ω—ã–π –Ω–∞ 10)
			struct Configuration
			{
				DpsPosition		dps0Position	:1;				// +
				DpsPosition		dps1Position	:1;				// +
				uint8_t			eks				:1;				// --- —Å–ø—Ä–æ—Å–∏—Ç—å (–≤—Å–µ–≥–¥–∞ –î–ê)
				uint8_t			tapKM130		:1;				// + –ö—Ä–∞–Ω –º–∞—à–∏–Ω–∏—Å—Ç–∞ –ö–ú-130 (1)
				uint8_t			club			:1;				// –§–ª–∞–≥ –ö–õ–£–ë-–£ –¥–ª—è –ª–æ–∫–æ–º–æ—Ç–∏–≤–Ω–æ–π —Å–∏–≥–Ω–∞–ª–∏–∑–∞—Ü–∏–∏ (–¥–ª—è –ë–õ–û–ö –≤—Å–µ–≥–¥–∞)
				VelocityGauge	velocityGauge	:1; 			// –?–∑–º–µ—Ä–∏—Ç–µ–ª—å —Å–∫–æ—Ä–æ—Å—Ç–∏
				IfSignal		ifSignal		:1; 			// –?—Å—Ç–æ—á–Ω–∏–∫ –?–§ —Å–∏–≥–Ω–∞–ª–∞ (–¥–ª—è –ë–õ–û–ö –≤—Å–µ–≥–¥–∞ –ê–õ–°)
				AlarmSystem		alarmSystem		:1; 			// –õ–æ–∫–æ–º–æ—Ç–∏–≤–Ω–∞—è —Å–∏–≥–Ω–∞–ª–∏–∑–∞—Ü–∏—è (–¥–ª—è –ë–õ–û–ö –≤—Å–µ–≥–¥–∞ –ö–õ–£–ë)
			};
			Eeprom< Bitfield<Configuration> > configuration;// +!
			Eeprom<uint16_t>	reserv1;    				// –†–µ–∑–µ—Ä–≤
			Eeprom<int8_t>		diameterCorrection[2]; 		// + –£—Ç–æ—á–Ω–µ–Ω–∏–µ –¥–∏–∞–º–µ—Ç—Ä–æ–≤ –±–∞–Ω–¥–∞–∂–µ–π —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤–µ–Ω–Ω–æ –¥–ª—è –î–ü–°1 –∏ –î–ü–°2. –í—ã—á–∏—Å–ª—è—é—Ç—Å—è –∫–∞–∫ —Ä–∞–∑–Ω–æ—Å—Ç—å –º–µ–∂–¥—É —Ç–æ—á–Ω—ã–º –∑–Ω–∞—á–µ–Ω–∏–µ–º
															//   —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤—É—é—â–µ–≥–æ –¥–∏–∞–º–µ—Ç—Ä–∞ –±–∞–Ω–¥–∞–∂–∞ –≤ –º–∏–ª–ª–∏–º–µ—Ç—Ä–∞—Ö –∏ —Å—Ä–µ–¥–Ω–∏–º –∑–Ω–∞—á–µ–Ω–∏–µ–º, —É–º–Ω–æ–∂–µ–Ω–Ω—ã–º –Ω–∞ 10.
															//   –°–µ–¥—å–º–æ–π –±–∏—Ç - –∑–Ω–∞–∫–æ–≤—ã–π. -- –í–ù–?–ú–ê–ù–?–ï -- —ç—Ç–æ –Ω–µ –¥–æ–ø–æ–ª–Ω–∏—Ç–µ–ª—å–Ω—ã–π –∫–æ–¥
			Eeprom<uint16_t>	controlSumm1;     			// + –ö–æ–Ω—Ç—Ä–æ–ª—å–Ω–∞—è —Å—É–º–º–∞ –ø–µ—Ä–≤–æ–π —Å—Ç—Ä–æ–∫–∏: CRC16 –Ω–∞ –±–∞–∑–∏—Å–µ 0xA9EB
			//  ------------------------------- –°—Ç—Ä–æ–∫–∞ 2 -------------------------------
			Eeprom<uint16_t>	string2Number; 				// + –ù–æ–º–µ—Ä –≤—Ç–æ—Ä–æ–π —Å—Ç—Ä–æ–∫–∏ (–∏—Å–ø–æ–ª—å–∑—É—é:0x0601, –º–æ–∂–Ω–æ(?) 0x0401)BigEndian.
			Eeprom<uint32_t>	locoName14;  				// +! –ù–∞–∑–≤–∞–Ω–∏–µ –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞ (DOS - –∫–æ–¥–∏—Ä–æ–≤–∫–∞), –¥–æ–ø–æ–ª–Ω–µ–Ω–Ω–æ–µ –ø—Ä–æ–±–µ–ª–∞–º–∏ (—Å–∏–º–≤–æ–ª–∞–º–∏ —Å –∫–æ–¥–æ–º 20h). 1-4 —Å–∏–º–≤–æ–ª—ã.
			Eeprom<uint16_t>	locoName56;					// +! –ù–∞–∑–≤–∞–Ω–∏–µ –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞. 5 –∏ 6 —Å–∏–º–≤–æ–ª—ã.
			Eeprom<uint16_t>	locoNumberBigEndian;		// + –ù–æ–º–µ—Ä –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞ (—Å–Ω–∞—á–∞–ª–∞ —Å—Ç–∞—Ä—à–∏–π –±–∞–π—Ç, –∑–∞—Ç–µ–º –º–ª–∞–¥—à–∏–π)
			enum class FeatureCode : uint8_t				// –ö–æ–¥ –æ—Å–æ–±–µ–Ω–Ω–æ—Å—Ç–µ–π –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞
			{
				None = 0,									// –ù–æ—Ä–º–∞–ª—å–Ω—ã–µ –ª–æ–∫–æ–º–æ—Ç–∏–≤—ã
				TractionSignalFromBsCkr = 1,				// –°–∏–≥–Ω–∞–ª "–¢—è–≥–∞" –æ—Ç –ë–°-–¶–ö–† (–ß–°2)
				TractionInversionSignal = 2					// –?–Ω–≤–µ—Ä—Å–Ω—ã–π —Å–∏–≥–Ω–∞–ª "–¢—è–≥–∞" (–ß–°4, –ß–°4–¢, –ß–°7, –≠–ü1, –í–õ65, –í–õ85, –í–õ11)
			};
			Eeprom<FeatureCode>	featureCode;
			Eeprom<uint8_t>		sectionNumber;				// +! –°–µ–∫—Ü–∏—è
			Eeprom<uint8_t>		vConstruct;					// +! –ö–æ–Ω—Å—Ç—Ä—É–∫—Ç–∏–≤–Ω–∞—è —Å–∫–æ—Ä–æ—Å—Ç—å –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞ (–∫–º/—á)
			Eeprom<uint8_t>		locoTip;					// +! –¢–∏–ø (–∫–æ–¥) –ø–æ–¥–≤–∏–∂–Ω–æ–π –µ–¥–∏–Ω–∏—Ü—ã (—Å–º. —Ñ–∞–π–ª "–¢–∏–ø—ã –ª–æ–∫–æ–º–æ—Ç–∏–≤–æ–≤")
			Eeprom<uint16_t>	controlSumm2;				// + –ö–æ–Ω—Ç—Ä–æ–ª—å–Ω–∞—è —Å—É–º–º–∞ –≤—Ç–æ—Ä–æ–π —Å—Ç—Ä–æ–∫–∏.
		} property;
	} saut; // [0x00 -- 0x1F] : 32 –±–∞–π—Ç–∞

//	EeCell cell[128];
	union Club
	{
		Club () {}
		EeCell cell[128];
		struct Property
		{
			EeCell		start;						//  0 - –¥–ª—è —Å–æ–≤–º–µ—Å—Ç–∏–º–æ—Å—Ç–∏ (—Å—á—ë—Ç –∏–¥—ë—Ç —Å 1)
			EeCell		track; 						//  1 - –ù–æ–º–µ—Ä –ø—É—Ç–∏ –¥–ª—è —Ö—Ä–∞–Ω–µ–Ω–∏—è –≤ –ú–ü–• –≠–ö
			EeCell		driver; 					//  2 - –ù–æ–º–µ—Ä –º–∞—à–∏–Ω–∏—Å—Ç–∞
			EeCell		train; 						//  3 - –ù–æ–º–µ—Ä –ø–æ–µ–∑–¥–∞
			EeCell		category; 					//  4 - –ö–∞—Ç–µ–≥–æ—Ä–∏—è –ø–æ–µ–∑–¥–∞
			EeCell		lengthWheel;				//  5 - –î–ª–∏–Ω–∞ —Å–æ—Å—Ç–∞–≤–∞ –≤ –æ—Å—è—Ö
			EeCell		lengthWagon; 				//  6 - –î–ª–∏–Ω–∞ —Å–æ—Å—Ç–∞–≤–∞ –≤ —É—Å–ª–æ–≤–Ω—ã—Ö –≤–∞–≥–æ–Ω–∞—Ö
			EeCell		locoNumber; 				//  7 - –ù–æ–º–µ—Ä –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞ –∏–ª–∏ –≤–µ–¥—É—â–µ–π —Å–µ–∫—Ü–∏–∏ –º–Ω–æ–≥–æ—Å–µ–∫—Ü–∏–æ–Ω–Ω–æ–≥–æ –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞
			EeCell		weigth; 					//  8 - –º–∞—Å—Å–∞ –ø–æ–µ–∑–¥–∞
			EeCell		coordStart;					//  9 - –ù–∞—á–∞–ª—å–Ω–∞—è –∫–æ–æ—Ä–¥–∏–Ω–∞—Ç–∞
			EeCell		time;						// 10 - –í—Ä–µ–º—è
			EeCell		typeLoco; 					// 11 - –¢–∏–ø –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞
			EeCell		vWhite; 						// 12 - –î–æ–ø—É—Å—Ç–∏–º–∞—è —Å–∫–æ—Ä–æ—Å—Ç—å (–Ω–∞ –±–µ–ª—ã–π)
			EeCell		vRedYellow; 				// 13 - –°–∫–æ—Ä–æ—Å—Ç—å –¥–≤–∏–∂–µ–Ω–∏—è –Ω–∞ –ö–ñ
			EeCell		blockLength;				// 14 - –ü—Ä–∏–≤–µ–¥—ë–Ω–Ω–∞—è –¥–ª–∏–Ω–∞ –±–ª–æ–∫-—É—á–∞—Å—Ç–∫–∞ ¬´–î–æ–∑–æ—Ä¬ª
			EeCell		diameter0; 					// 15 - –î–∏–∞–º–µ—Ç—Ä –±–∞–Ω–¥–∞–∂–∞ –∫–æ–ª–µ—Å–∞ 1, –º–º
			EeCell		diameter1; 					// 16 - –î–∏–∞–º–µ—Ç—Ä –±–∞–Ω–¥–∞–∂–∞ –∫–æ–ª–µ—Å–∞ 2, –º–º
			EeCell		dpsDentos;					// 17 - –ß–∏—Å–ª–æ –∑—É–±—å–µ–≤ –î–°
			struct Configuration
			{
				DpsPosition		dps0Position		:1; // 0 ---
				uint32_t		cabNumber			:1; // 1
				DpsPosition		dps1Position		:1; // 2
				uint32_t		dpsNumber			:1; // 3
				uint32_t		tskbm				:1; // 4
				uint32_t		aloneLogModule		:1; // 5
				uint32_t		staticDpsCheck		:1; // 6
				uint32_t		kupol				:1; // 7
				uint32_t		eks2				:1; // 8 ---
				enum TractusType { Autonomus = 0, Electric = 1 };
				TractusType		tractusType			:1; // 9
				uint32_t		autonomusModules	:1; // 10
				uint32_t							:1; // 11
				uint32_t		mpsu				:1; // 12
				uint32_t		uktol				:1; // 13
				uint32_t		epk151d				:1; // 14
				uint32_t							:1; // 15
				uint32_t							:16;
			};
			EeCell		configuration;				// 18 - –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è
			EeCell		vGreen; 					// 19 - –î–æ–ø—É—Å—Ç–∏–º–∞—è —Å–∫–æ—Ä–æ—Å—Ç—å –Ω–∞ –ó–µ–ª—ë–Ω—ã–π
			EeCell		dirCoord; 					// 20 - –ù–∞–ø—Ä–∞–≤–ª–µ–Ω–∏–µ –∏–∑–º–µ–Ω–µ–Ω–∏—è –∫–æ–æ—Ä–¥–∏–Ω–∞—Ç—ã
			EeCell		milage; 					// 21 - –ü—Ä–æ–±–µ–≥ –ª–æ–∫–æ–º–æ—Ç–∏–≤–∞
			EeCell		clsdVersion;				// 22 - –?–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –æ –≤–µ—Ä—Å–∏–∏ –ö–õ–£–ë
			EeCell		trackMPH; 					// 23 - –ù–æ–º–µ—Ä –ø—É—Ç–∏ –¥–ª—è —Ö—Ä–∞–Ω–µ–Ω–∏—è –≤ –ú–ü–• –í–ü–î
			EeCell		vpdPrivate; 				// 24 - –ü–∞—Ä–∞–º–µ–Ω—Ç—Ä –∏—Å–ø–æ–ª—å–∑—É–µ–º—ã–π —Ç–æ–ª—å–∫–æ –≤–Ω—É—Ç—Ä–∏ –ø—Ä–æ–≥—Ä–∞–º–º—ã –í–ü–î-–ú
			EeCell		bilBrightnes;  				// 25 - –ü–∞—Ä–∞–º–µ—Ç—Ä —è—Ä–∫–æ—Å—Ç–∏ –¥–ª—è –º–æ–¥—É–ª—è –ë–?–õ
			EeCell		snsPosition1;				// 26 - –†–∞—Å–ø–æ–ª–æ–∂–µ–Ω–∏–µ –°–ù–° –ø–µ—Ä–≤–æ–π –∫–∞–±–∏–Ω—ã
			EeCell		sndPosition2;				// 27 - –†–∞—Å–ø–æ–ª–æ–∂–µ–Ω–∏–µ –°–ù–° –≤—Ç–æ—Ä–æ–π –∫–∞–±–∏–Ω—ã
			//-----------------------–ó–∞–ø–∏—Å—å –ø–æ MCO_DATA---------------------------------------------------------
			EeCell		ufirOutConf;				// 28 - –£–§–?–† –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		tskbmOutConf;				// 29 - –¢–°–ö–ë–ú –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		sautOutConf;				// 30 - –°–ê–£–¢ –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		bilOutConf;					// 31 - –ë–?–õ –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		ipdOutConf;					// 32 - –?–ü–î –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		bvuOutConf;					// 33 - –ë–í–£ –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		mmOutConf;					// 34 - –ú–ú –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			EeCell		ecOutConf;					// 35 - –≠–ö –≤—ã—Ö–æ–¥–∏–ª –∏–∑ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏
			//-----------------------–ó–∞–ø–∏—Å—å –ø–æ BKSI_DATA--------------------------------------------------------
			EeCell		krError;					// 36 - –ù–∞–ª–∏—á–∏–µ –∏ –∏—Å–ø—Ä–∞–≤–Ω–æ—Å—Ç—å –ö–†
			EeCell		dps1Error;					// 37 - –û–±—Ä—ã–≤ –î–ü–°1
			EeCell		dps2Error;					// 38 - –û–±—Ä—ã–≤ –î–ü–°2
			EeCell		snsError;					// 39 - –ù–µ—Ç –¥–∞–Ω–Ω—ã—Ö –°–ù–°
			EeCell		epkError;					// 40 - –û–±—Ä—ã–≤ –≠–ü–ö
			EeCell		konError;					// 41 - –û–±—Ä—ã–≤ –ö–û–ù
			EeCell		epvError;					// 42 - –û–±—Ä—ã–≤ –≠–ü–í
			EeCell		eptError;					// 43 - –ù–µ–∏—Å–ø—Ä–∞–≤–µ–Ω –≠–ü–¢
			EeCell		pkm1TvError;				// 44 - –û–±—Ä—ã–≤ –ü–ö–ú1 –¢–í
			EeCell		pkm1OvError;				// 45 - –û–±—Ä—ã–≤ –ü–ö–ú1 –û–í
			EeCell		pkm2TvError;				// 46 - –û–±—Ä—ã–≤ –ü–ö–ú2 –¢–í
			EeCell		pkm2OvError;				// 47 - –û–±—Ä—ã–≤ –ü–ö–ú2 –û–í

			EeCell		empty[52];					// (—Ä–µ–∑–µ—Ä–≤)
			//-------------------------- –î–ª—è –°–ê–£–¢–∞ -------------------------------------------------------------
			EeCell		vMaxPassenger;				// 100
			EeCell		vRedYellowPassenger;		// 101
			EeCell		vMaxCargo;					// 102
			EeCell		vRedYellowCargo;			// 103
			EeCell		vMaxElectricTrain;			// 104
			EeCell		vRedYellowElectricTrain;	// 105
			EeCell		vConstruct;					// 106

			EeCell		locoType;					// 107
			EeCell		locoTip;					// 108
			EeCell		locoName1;					// 109
			EeCell		locoName2;					// 110
			EeCell		section;					// 111

			EeCell		dps0Position;				// 112 conf.0
			EeCell		dps1Position;				// 113 conf.2
			EeCell		eks;						// 114
			EeCell		tapKM130;					// 115
			EeCell		velocityGauge;				// 116
			EeCell		ifSignalSource;				// 117
			EeCell		alarmSystem;				// 118
			struct SautConfiguration
			{
				uint32_t		tapKM130			:1; // 0
				VelocityGauge	velocityGauge		:1; // 1
				uint32_t		eks					:1; // 2
				uint32_t		club				:1; // 3
				IfSignal		ifSignal			:1; // 4
				AlarmSystem		alarmSystem			:1; // 5
				uint32_t							:10;
				uint32_t							:16;
			};
			EeCell		sautConfiguration;			// 119

//			EeCell		end;						// –ø–æ—Å–ª–µ–¥–Ω—è—è —è—á–µ–π–∫–∞
		} property;
	} club;

	// –?—Å–ø—Ä–∞–≤–Ω–æ—Å—Ç–∏ –¥–∞—Ç—á–∏–∫–æ–≤
	Eeprom<uint8_t> 		dps0Good;
	Eeprom<uint8_t>			dps1Good;

} eeprom EEMEM;


// ------------------------------------ –ö–æ–Ω–≤–µ—Ä—Ç–∞—Ü–∏—è –≤ –°–ê–£–¢ --------------------------------------‚ñ∫
//
// ~~~ –ü—Ä–æ–±–ª–µ–º–∞: ~~~
// –•–∞—Ä–∞–∫—Ç–µ—Ä–∏—Å—Ç–∏–∫–∏ –∑–∞–ø–∏—Å—ã–≤–∞—é—Ç—Å—è –∏ —á–∏—Ç–∞—é—Ç—Å—è –∏–∑ —è—á–µ–µ–∫ –ø–æ –∞–ª–≥–æ—Ä–∏—Ç–º—É –ö–õ–£–ë–∞. –Ø—á–µ–π–∫–∏ –æ–ø–∏—Å–∞–Ω—ã –≤—ã—à–µ –≤ —Å—Ç—Ä—É–∫—Ç—É—Ä–µ Club,
// –ù–æ –¥–ª—è —Å–æ–≤–º–µ—Å—Ç–∏–º–æ—Å—Ç–∏ —Å –°–ê–£–¢–æ–º –Ω—É–∂–Ω–æ —Ö—Ä–∞–Ω–∏—Ç—å –∑–∞–ø–∏—Å–∞–Ω–Ω—É—é –≤ —è—á–µ–π–∫–∏ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é –µ—â—ë –∏ –≤ —Ñ–æ—Ä–º–∞—Ç–µ –°–ê–£–¢. (—Å–º. –≤—ã—à–µ Saut)
// –°–ê–£–¢ —Ç–æ–ª—å–∫–æ —á–∏—Ç–∞–µ—Ç —ç—Ç—É –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é, –Ω–æ –Ω–µ –∑–∞–ø–∏—Å—ã–≤–∞–µ—Ç.
//
// ~~~ –ó–∞–¥–∞—á–∞: ~~~
// 1. –ö–∞–∂–¥—ã–π —Ä–∞–∑ –ø—Ä–∏ –∑–∞–ø–∏—Å–∏ –ª—é–±–æ–π —è—á–µ–π–∫–∏ –ö–õ–£–ë–∞ –ø—Ä–æ–≤–µ—Ä—è—Ç—å, —á—Ç–æ –∑–∞ —è—á–µ–π–∫–∞ (–∏ –∫–∞–∫–∞—è –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è) –∑–∞–ø–∏—Å—ã–≤–∞–µ—Ç—Å—è.
// 2. –ï—Å–ª–∏ —ç—Ç–∞ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è —Å–æ–¥–µ—Ä–∂–∏—Ç—å—Å—è –≤ –±–∞–∑–µ –°–ê–£–¢, —Ç–æ –ø—Ä–µ–æ–±—Ä–∞–∑–æ–≤—ã–≤–∞—Ç—å –µ—ë –≤ –Ω—É–∂–Ω—ã–π —Ñ–æ—Ä–º–∞—Ç –∏ –∑–∞–ø–∏—Å—ã–≤–∞—Ç—å —Ç—É–¥–∞.
//
// ~~~ –†–µ—à–µ–Ω–∏–µ: ~~~
// 1. –ü–æ—Å–ª–µ –≤—Å–µ—Ö —à–∞–≥–æ–≤ –ø–æ –∑–∞–ø–∏—Å–∏ –¥–∞–Ω–Ω—ã—Ö –≤ —è—á–µ–π–∫—É –ö–õ–£–ë, –Ω–æ –¥–æ –≤—ã–¥–∞—á–∏ –ø–æ–¥—Ç–≤–µ—Ä–∂–¥–µ–Ω–∏—è –≤—Å—Ç–∞–≤–∏—Ç—å —ç—Ç–∞–ø –∫–æ–Ω–≤–µ—Ä—Ç–∞—Ü–∏–∏ –≤ –°–ê–£–¢. –ù–∞ —ç—Ç–æ–º —ç—Ç–∞–ø–µ:
//		- –ï—Å–ª–∏ –∑–∞–ø–∏—Å—ã–≤–∞–µ–º–∞—è –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è —Å–æ–¥–µ—Ä–∂–∏—Ç—å—Å—è –≤ –°–ê–£–¢, —Ç–æ —Å–∫–æ–Ω–≤–µ—Ä—Ç–∏—Ä–æ–≤–∞—Ç—å –µ—ë.
//		- –ó–∞–ø–∏—Å–∞—Ç—å –≤ –Ω—É–∂–Ω—ã–µ –ø–æ–ª—è –æ–±–ª–∞—Å—Ç–∏ –°–ê–£–¢.
//		- –û–±–Ω–æ–≤–∏—Ç—å crc —Å–æ–æ—Ç–≤–µ—Ç—Å–≤—É—é—â–µ–π —Å—Ç—Ä–æ–∫–∏.
//		- –ü—Ä–æ–≤–µ—Ä–∏—Ç—å –Ω–∞–ª–∏—á–∏–µ –∑–∞–≥–æ–ª–æ–≤–∫–∞ —Å—Ç—Ä–æ–∫–∏.
// 2. –ü—Ä–∏ —ç—Ç–æ–º –æ—Ç—Å—É—Ç—Å–≤—É–µ—Ç –∫–æ–Ω—Ç—Ä–æ–ª—å —Ü–µ–ª–æ—Å—Ç–Ω–æ—Å—Ç–∏ –°–ê–£–¢–æ–≤—Å–∫–æ–π —á–∞—Å—Ç–∏ (—ç—Ç–æ –º–æ–∂–µ—Ç –¥–µ–ª–∞—Ç—å –°–ê–£–¢, –ø—Ä–∏ —ç—Ç–æ–º crc –Ω—É–∂–Ω–æ –Ω–µ –∑–∞–±—ã–≤–∞—Ç—å –æ–±–Ω–æ–≤–ª—è—Ç—å –Ω–∞–º).
// 3. –í —Å–ª—É—á–∞–µ –ø—Ä–µ—Ä—ã–≤–∞–Ω–∏—è –ø—Ä–æ—Ü–µ—Å—Å–∞ –∑–∞–ø–∏—Å–∏ –æ–±–µ—Å–ø–µ—á–∏—Ç—å –≤–æ–∑–º–æ–∂–Ω–æ—Å—Ç—å –ø—Ä–µ—Ä–≤–∞—Ç—å –∑–∞–ø–∏—Å—å –≤ –°–ê–£–¢.
// 5. –î–ª—è –±—ã—Å—Ç—Ä–æ–≥–æ –æ—Ç–≤–µ—Ç–∞ –Ω–∞ –∑–∞–ø—Ä–æ—Å –æ—Ç –°–ê–£–¢–∞ –Ω–∞ —á—Ç–µ–Ω–∏–µ eeprom –Ω—É–∂–Ω–æ —Ö—Ä–∞–Ω–∏—Ç—å –∫–æ–ø–∏—é –≤ –æ–ø–µ—Ä–∞—Ç–∏–≤–∫–µ (–≤–¥—Ä—É–≥ –Ω–µ –±—É–¥–µ—Ç –¥–æ—Å—Ç—É–ø–∞ –∫ eeprom)
//    –? –æ–±–Ω–æ–≤–ª—è—Ç—å —ç—Ç—É –∫–æ–ø–∏—é —Ä–µ–≥—É–ª—è—Ä–Ω–æ.
//
// ~~~ –?–Ω—Ç–µ—Ä—Ñ–µ–π—Å: ~~~
// 1. updateCell (number, data, afterUpdate)
//    - –§—É–Ω–∫—Ü–∏—è, –∫–æ—Ç–æ—Ä–∞—è –¥–æ–ª–∂–Ω–∞ –±—ã—Ç—å –≤—ã–∑–≤–∞–Ω–∞ –≤ –∑–≤–µ–Ω–µ —ç—Ç–∞–ø–æ–≤ –∑–∞–ø–∏—Å–∏ –ø–æ—Å–ª–µ –∑–∞–ø–∏—Å–∏ –≤ –ö–õ–£–ë –∏ –ø–µ—Ä–µ–¥ –≤—ã–¥–∞—á–µ–π —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞.
//    - –ü—Ä–æ–∏–∑–≤–æ–¥–∏—Ç –≤—Å—é —Ä–∞–±–æ—Ç—É –ø–æ –∫–æ–Ω–≤–µ—Ä—Ç–∞—Ü–∏–∏ –∏ –∑–∞–ø–∏—Å–∏ (–µ—Å–ª–∏ –Ω—É–∂–Ω–æ).
//    - –Ø–≤–ª—è–µ—Ç—Å—è –Ω–µ–±–ª–æ–∫–∏—Ä—É—é—â–µ–π. –ü–æ—Å–ª–µ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è —Å–≤–æ–µ–π —Ä–∞–±–æ—Ç—ã –≤—ã–∑—ã–≤–∞–µ—Ç –¥–µ–ª–µ–≥–∞—Ç afterUpdate.
//    - –ù—É–∂–Ω–æ —Å—Ç—Ä–æ–≥–æ —Å–ª–µ–¥–∏—Ç—å, —á—Ç–æ–±—ã –Ω–µ –∑–∞–ø—É—Å—Ç–∏—Ç—å —ç—Ç—É —Ñ—É–Ω–∫—Ü–∏—é –µ—â—ë —Ä–∞–∑ –¥–æ —Ç–æ–≥–æ, –∫–∞–∫ –æ–Ω–∞ –æ—Ç—Ä–∞–±–æ—Ç–∞–ª–∞ –ø—Ä–µ–¥—ã–¥—É—â–∏–π —Ä–∞–∑!
// 2. reset (afterReset)
//    - –§—É–Ω–∫—Ü–∏—è –ø—Ä–µ—Ä—ã–≤–∞–µ—Ç —Ç–µ–∫—É—â—É—é —Ä–∞–±–æ—Ç—É (–µ—Å–ª–∏ –∏–¥—ë—Ç) –∏ –ø–æ—Å–ª–µ —ç—Ç–æ–≥–æ –≤—ã–∑—ã–≤–∞–µ—Ç –¥–µ–ª–µ–≥–∞—Ç afterReset.
//    - –ß—Ç–æ –ø—Ä–∏ —ç—Ç–æ–º –æ—Å—Ç–∞–Ω–µ—Ç—Å—è –≤ eeprom –Ω–µ –∏–∑–≤–µ—Å—Ç–Ω–æ. –í–æ–∑–º–æ–∂–Ω–æ –Ω–µ —É—Å–ø–µ–µ—Ç –æ–±–Ω–æ–≤–∏—Ç—å—Å—è crc.
//      –¢–æ–≥–¥–∞ –æ–Ω–∞ –≤–æ—Å—Å—Ç–∞–Ω–æ–≤–∏—Ç—Å—è —Ç–æ–ª—å–∫–æ –ø—Ä–∏ —Å–ª–µ–¥—É—é—â–µ–π –∑–∞–ø–∏—Å–∏ —ç—Ç–æ–π —Å—Ç—Ä–æ–∫–∏.
// 3. plainMap[32]
//    - –ø–æ–±–∞–π—Ç–Ω—ã–π –º–∞—Å—Å–∏–≤ –≤ –æ–ø–µ—Ä–∞—Ç–∏–≤–Ω–æ–π –ø–∞–º—è—Ç–∏, –æ—Ç—Ä–∞–∂–∞—é—â–∏–π —Ç–µ–∫—É—â–µ–µ —Å–æ—Å—Ç–æ—è–Ω–∏–µ eeprom.
//

class SautConvert
{
public:
	SautConvert ();
	void updateCell (uint8_t number, Complex<uint32_t> data, const SoftIntHandler& afterUpdate);
	void reset (SoftIntHandler afterReset);

	uint8_t plainMap[32]; // –æ—Ç–æ–±—Ä–∞–∂–µ–Ω–∏–µ –≤ ram –¥–∞–Ω–Ω—ã—Ö –∏–∑ eeprom

private:
	void init1StringPlainMap (uint16_t );
	void dataUpdate (uint16_t);
	void diametersWriteStep1 (uint16_t);
	void diametersWriteStep2 (uint16_t);
	void diametersWriteStep3 (uint16_t);
	void updateStringCrc (uint16_t pointer);
	void readNextStringByte (uint16_t byteStringNumber);
	template<uint16_t poly>
	uint16_t crcUpdate (uint16_t crc, const uint8_t& data);
	void runAfterReset (uint16_t);

	uint8_t diamAvrDiv10;
	int8_t diamCor[2];

	uint16_t crc;
	uint8_t stringNumber;
	uint8_t cellNumber;
	Complex<uint32_t> data;
	SoftIntHandler runAfter;
	bool eepromOpRunning;
	enum ResetRequest
	{
		No	= 0,
		SelfWaitCycle = 1,
		AfterEepromOp = 2
	};
	ResetRequest resetRequest;
	SoftIntHandler afterReset;

};

SautConvert::SautConvert ()
	: eepromOpRunning (false), resetRequest (No)
{
	stringNumber = 0;
	runAfter = SoftIntHandler::from_method<SautConvert, &SautConvert::init1StringPlainMap>(this);
	updateStringCrc (0);
}

void SautConvert::init1StringPlainMap (uint16_t	)
{
	runAfter = SoftIntHandler();
	stringNumber = 1;
	updateStringCrc (0);
}

void SautConvert::updateCell (uint8_t number, Complex<uint32_t> data, const SoftIntHandler& afterUpdate)
{
	cellNumber = number;
	SautConvert::data = data;
	runAfter = afterUpdate;

	dataUpdate (0);
}

void SautConvert::reset (SoftIntHandler afterReset)
{
	SautConvert::afterReset = afterReset;

	if (eepromOpRunning)
		resetRequest = ResetRequest::AfterEepromOp;
	else
	{
		resetRequest = ResetRequest::SelfWaitCycle;
		// –ø–æ—Å–ª–µ –≤—Å–µ—Ö –∑–∞–¥–∞—á –≤ –æ—á–µ—Ä–µ–¥–∏ –∑–∞–ø—É—Å—Ç–∏—Ç—å:
		dispatcher.add( SoftIntHandler::from_method<SautConvert, &SautConvert::runAfterReset>(this), 0 );
	}

}

void SautConvert::dataUpdate (uint16_t )
{
	if (resetRequest == ResetRequest::No)
	{
		eepromOpRunning = true;

		if (cellNumber == 7) // locoNumber
		{
			stringNumber = 1;
			if ( eeprom.saut.property.locoNumberBigEndian.updateUnblock(
					(uint16_t)Complex<uint16_t>{ data[1], data[0] },
					SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else if (cellNumber == 15 || cellNumber == 16) // diameter0, diameter1
		{
			uint8_t num = (cellNumber == 16); // –ù–æ–º–µ—Ä –≤–≤–æ–¥–∏–º–æ–≥–æ –±–∞–Ω–¥–∞–∂–∞
			eepromOpRunning = false;

			uint8_t sreg = reg.status;
			cli ();
			if (	eeprom.saut.property.diameterCorrection[!num].isReady() &&
					eeprom.saut.property.diameterAverageDiv10.isReady() 	)
			{
				diamCor[!num] =  eeprom.saut.property.diameterCorrection[!num];
				diamAvrDiv10  =  eeprom.saut.property.diameterAverageDiv10;
				reg.status = sreg;

				uint16_t diam[2];
				diam[!num] = uint16_t(diamAvrDiv10) * 10 +
								(diamCor[!num] & 0x7F) * (diamCor[!num] >= 0 ? 1 : -1); // –æ—Ç—Ä–∏—Ü–∞—Ç–µ–ª—å–Ω–æ–µ –≤ –ø—Ä—è–º–æ–º –∫–æ–¥–µ
				diam[num] = (uint16_t)Complex<uint16_t>{ data[0], data[1] };

				if ( abs(diam[num] - diam[!num]) > 246 )  // –¥—Ä—É–≥–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –æ—Ç—Å—Ç–æ–∏—Ç —Å–ª–∏—à–∫–æ–º –¥–∞–ª–µ–∫–æ
				{
					// —Ç–æ–≥–¥–∞, —á—Ç–æ –¥–µ–ª–∞—Ç—å, –ø–æ–¥–≤–∏–Ω–µ–º –µ–≥–æ –ø–æ–±–ª–∏–∂–µ
					if (diam[num] < diam[!num])
						diam[!num] = diam[num] + 245;
					else
						diam[!num] = diam[num] - 245;
				}

				 // –ù–∞ —ç—Ç–æ—Ç –º–æ–º–µ–Ω—Ç —Ä–∞–∑–ª–∏—á–∏–µ –≤ –¥–∏–∞–º–µ—Ç—Ä–∞—Ö –Ω–µ –±–æ–ª–µ–µ 10, –ø–æ—ç—Ç–æ–º—É –∫–æ—Ä—Ä–µ–∫—Ç–∏—Ä–æ–≤–∫–∏ –Ω–µ –±–æ–ª–µ–µ 127
				diamAvrDiv10 = (diam[num] + diam[!num]) / 20;

				for (uint8_t i = 0; i <= 1; i ++)
				{
					diamCor[i] = diam[i] - diamAvrDiv10 * 10;
					if ( diamCor[i] < 0 )
						diamCor[i] = ((~diamCor[i]) | 128) + 1; // –∑–Ω–∞–∫ –≤ –ø—Ä—è–º–æ–º –∫–æ–¥–µ
				}

				dispatcher.add( SoftIntHandler::from_method<SautConvert, &SautConvert::diametersWriteStep1>(this), 0 );
				return;
			}
			else
				reg.status = sreg;
		}
		else if (cellNumber == 18) // configuration
		{
			uint8_t sreg = reg.status;
			cli ();
			if ( eeprom.saut.property.configuration.isReady() )
			{
				Bitfield<EepromData::Saut::Property::Configuration> sautConf = eeprom.saut.property.configuration;
				reg.status = sreg;

				Bitfield<EepromData::Club::Property::Configuration> clubConf = (uint32_t)Complex<uint32_t>{ data[0], data[1], data[2], data[3] };

				sautConf.dps0Position = clubConf.dps0Position;
				sautConf.dps1Position = clubConf.dps1Position;

				stringNumber = 0;
				if ( eeprom.saut.property.configuration.updateUnblock( sautConf, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
					return;
			}
			else
				reg.status = sreg;
		}
		else if (cellNumber == 119) // Saut configuration
		{
			uint8_t sreg = reg.status;
			cli ();
			if ( eeprom.saut.property.configuration.isReady() )
			{
				Bitfield<EepromData::Saut::Property::Configuration> sautConf = eeprom.saut.property.configuration;
				reg.status = sreg;

				Bitfield<EepromData::Club::Property::SautConfiguration> conf = (uint32_t)Complex<uint32_t>{ data[0], data[1], data[2], data[3] };

				sautConf.eks = conf.eks;
				sautConf.tapKM130 = conf.tapKM130;
				sautConf.club = conf.club;
				sautConf.velocityGauge = conf.velocityGauge;
				sautConf.ifSignal = conf.ifSignal;
				sautConf.alarmSystem = conf.alarmSystem;

				stringNumber = 0;
				if ( eeprom.saut.property.configuration.updateUnblock( sautConf, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
					return;
			}
			else
				reg.status = sreg;
		}
		else if (cellNumber == 100 || cellNumber == 101) // vMaxPassenger || vRedYellowPassenger
		{
			uint8_t sreg = reg.status;
			cli ();
			if ( eeprom.saut.property.vPassenger.isReady() )
			{
				Bitfield<EepromData::Saut::Property::SpeedLimitation> vPas = eeprom.saut.property.vPassenger;
				reg.status = sreg;

				if (cellNumber == 100)
					vPas.maxDiv10Minus1 = data[0]/10 - 1;
				if (cellNumber == 101)
					vPas.redYellowDiv10Minus1 = data[0]/10 - 1;

				stringNumber = 0;
				if ( eeprom.saut.property.vPassenger.updateUnblock( vPas, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
					return;
			}
			else
				reg.status = sreg;
		}
		else if (cellNumber == 102 || cellNumber == 103) // vMaxElectricCargo || vRedYellowCargo
		{
			uint8_t sreg = reg.status;
			cli ();
			if ( eeprom.saut.property.vCargo.isReady() )
			{
				Bitfield<EepromData::Saut::Property::SpeedLimitation> vCargo = eeprom.saut.property.vCargo;
				reg.status = sreg;

				if (cellNumber == 102)
					vCargo.maxDiv10Minus1 = data[0]/10 - 1;
				if (cellNumber == 103)
					vCargo.redYellowDiv10Minus1 = data[0]/10 - 1;

				stringNumber = 0;
				if ( eeprom.saut.property.vCargo.updateUnblock( vCargo, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
					return;
			}
			else
				reg.status = sreg;
		}
		else if (cellNumber == 104 || cellNumber == 105) // vMaxElectricElectricTrain || vRedYellowElectricTrain
		{
			uint8_t sreg = reg.status;
			cli ();
			if ( eeprom.saut.property.vElecticTrain.isReady() )
			{
				Bitfield<EepromData::Saut::Property::SpeedLimitation> vElecticTrain = eeprom.saut.property.vElecticTrain;
				reg.status = sreg;

				if (cellNumber == 104)
					vElecticTrain.maxDiv10Minus1 = data[0]/10 - 1;
				if (cellNumber == 105)
					vElecticTrain.redYellowDiv10Minus1 = data[0]/10 - 1;

				stringNumber = 0;
				if ( eeprom.saut.property.vElecticTrain.updateUnblock( vElecticTrain, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
					return;
			}
			else
				reg.status = sreg;
		}
		else if (cellNumber == 106) // vConstruct
		{
			stringNumber = 1;
			if ( eeprom.saut.property.vConstruct.updateUnblock( data[0], SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else if (cellNumber == 107) // locoType
		{
			stringNumber = 0;
			if ( eeprom.saut.property.locoType.updateUnblock( data[0], SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else if (cellNumber == 108) // locoTip
		{
			stringNumber = 1;
			if ( eeprom.saut.property.locoTip.updateUnblock( data[0], SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else if (cellNumber == 109) // locoName1
		{
			stringNumber = 1;
			if ( eeprom.saut.property.locoName14.updateUnblock(
					(uint32_t)Complex<uint32_t>{ data[3], data[2], data[1], data[0] }, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else if (cellNumber == 110) // locoName2
		{
			stringNumber = 1;
			if ( eeprom.saut.property.locoName56.updateUnblock(
					(uint16_t)Complex<uint16_t>{ data[3], data[2] }, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else if (cellNumber == 111) // section
		{
			stringNumber = 1;
			if ( eeprom.saut.property.sectionNumber.updateUnblock( data[0], SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
				return;
		}
		else
		{
			eepromOpRunning = false;
			dispatcher.add( runAfter, 0 );
			return;
		}

		// –ï—Å–ª–∏ –≤ —Å–≤–æ—ë–º –º–µ—Å—Ç–µ —É—Å–ø–µ—à–Ω–æ –Ω–µ –∑–∞–≤–µ—Ä—à–∏–ª—Å—è return'–æ–º
		eepromOpRunning = false;
		dispatcher.add( Command{SoftIntHandler::from_method<SautConvert, &SautConvert::dataUpdate>(this), 0} );
	}
	else if (resetRequest == ResetRequest::SelfWaitCycle)
	{
		runAfterReset(0);
	}
}

void SautConvert::diametersWriteStep1 (uint16_t)
{
	eepromOpRunning = false;
	if (resetRequest == ResetRequest::No)
	{
		if ( eeprom.saut.property.diameterAverageDiv10.updateUnblock(
				diamAvrDiv10,
				SoftIntHandler::from_method<SautConvert, &SautConvert::diametersWriteStep2>(this) )
				)
			eepromOpRunning = true;
		else
			dispatcher.add( SoftIntHandler::from_method<SautConvert, &SautConvert::diametersWriteStep1>(this), 0 );
	}
	else if (resetRequest == ResetRequest::AfterEepromOp)
	{
		runAfterReset(0);
	}
}

void SautConvert::diametersWriteStep2 (uint16_t)
{
	eepromOpRunning = false;
	if (resetRequest == ResetRequest::No)
	{
		if ( eeprom.saut.property.diameterCorrection[0].updateUnblock(
				diamCor[0],
				SoftIntHandler::from_method<SautConvert, &SautConvert::diametersWriteStep3>(this) )
				)
			eepromOpRunning = true;
		else
			dispatcher.add( SoftIntHandler::from_method<SautConvert, &SautConvert::diametersWriteStep2>(this), 0 );
	}
	else if (resetRequest == ResetRequest::AfterEepromOp)
	{
		runAfterReset(0);
	}
}

void SautConvert::diametersWriteStep3 (uint16_t)
{
	eepromOpRunning = false;
	if (resetRequest == ResetRequest::No)
	{
		stringNumber = 0;
		if ( eeprom.saut.property.diameterCorrection[1].updateUnblock(
				diamCor[1],
				SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) )
				)
			eepromOpRunning = true;
		else
			dispatcher.add( SoftIntHandler::from_method<SautConvert, &SautConvert::diametersWriteStep3>(this), 0 );
	}
	else if (resetRequest == ResetRequest::AfterEepromOp)
	{
		runAfterReset(0);
	}
}

void SautConvert::updateStringCrc (uint16_t pointer)
{
	eepromOpRunning = false; // –≠—Ç–∞ —Ñ—É–Ω–∫—Ü–∏—è –≤—ã–∑—ã–≤–∞–µ—Ç—Å—è –ø–æ –∑–∞–≤–µ—Ä—à–µ–Ω–∏—é –æ–ø–µ—Ä–∞—Ü–∏–∏ eeprom
	uint8_t str = stringNumber;
	crc = 0;
	readNextStringByte( Complex<uint16_t>{str,0} );
}

void SautConvert::readNextStringByte (uint16_t byteStringNumber)
{
	if (resetRequest == ResetRequest::No)
	{
		uint8_t& string = Complex<uint16_t> (byteStringNumber)[0];
		uint8_t& byte = Complex<uint16_t> (byteStringNumber)[1];

		if (byte == 14)
		{
			if ( eeprom.saut.string[string].crc.updateUnblock( swap(crc), runAfter ) )
			{
				plainMap[string*16+14] = uint8_t(crc/256);
				plainMap[string*16+15] = uint8_t(crc);

				return;
			}
		}
		else
		{
			uint8_t sreg = reg.status;
			cli ();
			if ( eeprom.saut.string[string].data[byte].isReady() )
			{
				uint8_t data = eeprom.saut.string[string].data[byte];
				reg.status = sreg;


				// –í–æ—Å—Å—Ç–∞–Ω–æ–≤–ª–µ–Ω–∏–µ "–Ω–æ–º–µ—Ä–∞ —Å—Ç—Ä–æ–∫–∏" –≤ —Å–ª—É—á–∞–µ –æ—Ç—Å—É—Ç—Å–≤–∏—è
				eepromOpRunning = true; // –ø—Ä–∏–≥–æ—Ç–æ–≤–∏–º—Å—è –∫ –∑–∞–ø–∏—Å–∏
				if (byte == 0 && data != 0x06)
				{
					if ( eeprom.saut.string[string].data[0].updateUnblock( 0x06, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
						return;
				}
				else if (byte == 1 && string == 0 && data != 0x00)
				{
					if ( eeprom.saut.string[0].data[1].updateUnblock( 0x00, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
						return;
				}
				else if (byte == 1 && string == 1 && data != 0x01)
				{
					if ( eeprom.saut.string[1].data[1].updateUnblock( 0x01, SoftIntHandler::from_method<SautConvert, &SautConvert::updateStringCrc>(this) ) )
						return;
				}
				else // "–ù–æ–º–µ—Ä–∞ —Å—Ç—Ä–æ–∫" –ø—Ä–æ–ø–∏—Å–∞–Ω—ã –∫–æ—Ä—Ä–µ–∫—Ç–Ω–æ.
				{
					eepromOpRunning = false; // –∑–∞–ø–∏—Å—å –Ω–µ –ø–æ–Ω–∞–¥–æ–±–∏–ª–∞—Å—å

					// –û–±–Ω–æ–≤–ª—è–µ–º plainMap
					plainMap[string*16+byte] = data;

					// –í—ã–ø–æ–ª–Ω—è–µ–º –ø–æ–¥—Å—á—ë—Ç crc..
					crc = crcUpdate<0xEBA9> (crc, data);
					readNextStringByte( Complex<uint16_t>{string, byte+1} );
					return;
				}
			}
			else
				reg.status = sreg;
		}

		dispatcher.add( Command{SoftIntHandler::from_method<SautConvert, &SautConvert::readNextStringByte>(this), byteStringNumber} );
	}
	else if (resetRequest == ResetRequest::AfterEepromOp)
	{
		runAfterReset(0);
	}
}

template<uint16_t poly>
uint16_t SautConvert::crcUpdate (uint16_t crc, const uint8_t& data)
{
	crc ^= (uint16_t(data) << 8);
    for (uint8_t i = 0; i < 8; i++)
        crc = crc & 0x8000 ? (crc << 1) ^ poly : crc << 1;
    return crc;
}

void SautConvert::runAfterReset (uint16_t)
{
	resetRequest = ResetRequest::No;
	dispatcher.add( afterReset, 0 );
}

// --------------------------------------- –°–≤—è–∑—å —Å CAN ------------------------------------------‚ñ∫

template <  typename CanDatType, CanDatType& canDat,
			typename Scheduler, Scheduler& scheduler >
class ConstValModule
{
public:
	ConstValModule ();

	void getWriteMessage (uint16_t getDataPointer);
	void getLeftDataMessage (uint16_t getDataPointer);
	void getQueryMessage (uint16_t getDataPointer);

	SautConvert sautConvert;

private:
	void isWritten (uint16_t res);
	void isGoodWhenWrite (uint16_t res);
	void isGoodWhenRead (uint16_t res);
	void confirm (uint16_t tryNumber);
	void write (uint16_t tryNumber);
	void read (uint16_t written);
	void sautWrite (uint16_t status);
	void successEnd (uint16_t );

	void sendState (uint16_t );
	void checkNext (uint16_t res);
	void checkWrite (uint16_t written);

	void resetAllOps (uint16_t);
	void resetSautConvert (uint16_t);
	void initAfterReset (uint16_t);

	enum Status
	{
		OK				= 0,
		ErrBusy			= 1,
		ErrUnwritten	= 2,
		ErrWrongCrc		= 3,
		ErrUnknownNum	= 4,
		ErrUnknown		= 5
	};
	void endOperation (const Status& status);


	struct Packet
	{
		uint8_t number;
		Complex<uint32_t> data;
	};
	Packet activePacket;

	struct
	{
		Complex<uint32_t>	train; 			// 3
		uint8_t				category;		// 4
		uint8_t				lengthWagon;	// 6
		Complex<uint16_t>	type;			// 11
		uint8_t				vWhite;			// 12
		uint8_t				vRedYellow;		// 13
		uint16_t			blockLength;	// 14
		Complex<uint16_t>	configuration;	// 18
		Complex<uint16_t>	vGreen;			// 19
		uint8_t				trackMPH;		// 23
		struct WrittenFlags
		{
			uint16_t	train			:1;
			uint16_t	category		:1;
			uint16_t	lengthWagon		:1;
			uint16_t	type			:1;
			uint16_t    vWhite			:1;
			uint16_t	vRegYellow		:1;
			uint16_t	blockLength		:1;
			uint16_t	configuration	:1;
			uint16_t	vGreen			:1;
			uint16_t	trackMPH		:1;
		};
		Bitfield<WrittenFlags> written;
	}
	monitoredData;
	uint8_t interrogateCell;
	uint8_t wrongCell;


	uint8_t killerId;
	bool reset;
	bool resetMonitor;
};



template <  typename CanDatType, CanDatType& canDat,
			typename Scheduler, Scheduler& scheduler >
ConstValModule<CanDatType, canDat, Scheduler, scheduler>::ConstValModule ()
	: sautConvert (), interrogateCell (128), wrongCell (0), activePacket({0,0}), reset(false)
{
	scheduler.runIn(
			Command {SoftIntHandler::from_method<ConstValModule,&ConstValModule::sendState> (this), 0},
			500 );
}

template <  typename CanDatType, CanDatType& canDat,
